snlkuharlocal/src/Documents/ЗаявкаНаПроизводство/ЗаявкаНаПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПроизводство</name>
  <comment>Заявка на производство</comment>
  <basedOn>Document.ЗаявкаНаПроизводство</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикамШтуки</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.КонтрактСПроизводителем</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаявкаНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаказа</name>
    <type>
      <types>EnumRef.СостояниеЗаказаПоставщику</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <comment>Ожидаемая дата прихода заказа</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <comment>Дата оплаты заказа</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Фабрики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленоПоставщику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеОтчетаОснование</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодтвержденнаяЗаявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаПоставщику</name>
      <type>
        <types>DocumentRef.КонтрактСПроизводителем</types>
        <types>DocumentRef.ЗаявкаНаПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Фабрика</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказКонтрагента</name>
      <type>
        <types>DocumentRef.Заказ</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКомплектующих</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаПоставщику</name>
      <type>
        <types>DocumentRef.КонтрактСПроизводителем</types>
        <types>DocumentRef.ЗаявкаНаПроизводство</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/СостояниеЗаказаПоставщику/СостояниеЗаказаПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеЗаказаПоставщику</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ПредварительныйЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденныйЗаказ</name>
  </enumValues>
  <enumValues>
    <name>Ликвидирован</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>Таможня</name>
    <comment>Растамаживается</comment>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>ВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>Произведен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>ВПутиВРФ</name>
  </enumValues>
  <enumValues>
    <name>ГотовоКОтгрузке</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыНоменклаутры/ВидыНоменклаутры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклаутры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>МБП</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>КомпьютернаяТехника</name>
  </enumValues>
  <enumValues>
    <name>РекламаПлатная</name>
  </enumValues>
  <enumValues>
    <name>РекламаБесплатная</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>ТМЦнаОтветственномХранении</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаявкаНаПроизводство/ObjectModule.bsl
Перем НеКонтролироватьЗапись;


Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Возврат  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];		
		НаборЗаписей.Очистить();
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры 


//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения		=Модифицированность();	
	
	Если НЕ ОбменДанными.Загрузка Тогда
		Если НеКонтролироватьЗапись Тогда
		Иначе
			//КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
			МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
			МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		КонецЕсли;		
		
		Если Отказ Тогда Возврат КонецЕсли;		
	КонецЕсли;	
	
	Если ЕстьИзменения Тогда 
		СуммаДокумента		= Товары.Итог("Всего");
		ОбъемДокумента		= Товары.Итог("Объем");
		КоличествоДокумента = Товары.Итог("Количество");		
		
		ГруппыТоваров   	= ГруппыТоваровДокумента(ЭтотОбъект);		
	КонецЕсли;
	//++Данилова Е.В. 28.07.2025  HELP-6187
	Если ЕстьИзменения
		И Дата >= Дата(2025,07,01) Тогда
	
		ЗаполнитьТЧКомплектующие(); 	
	    ПроверитьТЧКомплектующие(Отказ); 
		
	КонецЕсли;
	//--Данилова Е.В. 28.07.2025

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	СостояниеНакладной	=Неопределено;
	Автор				=Неопределено;
КонецПроцедуры


Функция ПроводитьПоЗаказам(ДокСсылка)
	Если ДокСсылка.СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.ПодтвержденныйЗаказ
			ИЛИ ДокСсылка.СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.ВПути			
			ИЛИ ДокСсылка.СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.Таможня Тогда			
		Возврат Истина;
	Иначе
		Возврат Ложь;			
	КонецЕсли;
КонецФункции // ()
 

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	ДвиженияПоРегистрам=Неопределено;
	
	Если СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.ПредварительныйЗаказ ИЛИ  СостояниеЗаказа=Перечисления.СостояниеЗаказаПоставщику.ПодтвержденныйЗаказ Тогда 
	Иначе
		Возврат;
	КонецЕсли;
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	//++Данилова Е.В. 29.07.2025  HELP-6187
	//Доллары		= Справочники.Валюты.НайтиПоКоду("840");
	//Евро		= Справочники.Валюты.НайтиПоКоду("978");
	//
	//КурсВалюты	= ПолучитьКурсВалюты_ПоРусски(Валюта,Дата);
	//
	//ВалютаУпр	= ?(Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);
	//КурсУпр		= ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,Дата);
	//
	//КурсДоллара	= ПолучитьКурсВалюты(Доллары,Дата).Курс;
	//КурсЕвро	= ПолучитьКурсВалюты(Евро,Дата).Курс;
	//Рубли		= ПараметрыСеанса.ВалютаНац;
	 
	Если Дата >= Дата(2025,07,01) Тогда   	
			
		ДвижениеПоЗаказамПоставщикам("Комплектующие","ЗаказыПоставщикамШтуки");
		 
	КонецЕсли;	
	
	ДвижениеПоЗаказамПоставщикам("Товары","ЗаказыПоставщикам");
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЗаявкаНаПроизводствоКомплектующие.Номенклатура КАК Номенклатура,
	//|	СУММА(ЗаявкаНаПроизводствоКомплектующие.Количество) КАК Количество,
	//|	ЗаявкаНаПроизводствоКомплектующие.Единица КАК Единица,
	//|	ЗаявкаНаПроизводствоКомплектующие.Коэффициент КАК Коэффициент,
	//|	МАКСИМУМ(ЗаявкаНаПроизводствоКомплектующие.Цена) КАК Цена,
	//|	СУММА(ЗаявкаНаПроизводствоКомплектующие.Сумма) КАК Сумма,
	//|	СУММА(ЗаявкаНаПроизводствоКомплектующие.Всего) КАК Всего
	//|ИЗ
	//|	Документ.ЗаявкаНаПроизводство.%ИмяТЧДляДвижений% КАК ЗаявкаНаПроизводствоКомплектующие
	//|ГДЕ
	//|	ЗаявкаНаПроизводствоКомплектующие.Ссылка = &Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЗаявкаНаПроизводствоКомплектующие.Единица,
	//|	ЗаявкаНаПроизводствоКомплектующие.Номенклатура,
	//|	ЗаявкаНаПроизводствоКомплектующие.Коэффициент";
	//
	//Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	//Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИмяТЧДляДвижений%",ИмяТЧДляДвижений); 
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//СтрокаТЧ = РезультатЗапроса.Выбрать(); 
	//
	////Для Каждого СтрокаТЧ Из Товары Цикл
	//Пока СтрокаТЧ.Следующий() Цикл
	//	//--Данилова Е.В. 29.07.2025
	//	Если СтрокаТЧ.Количество=0 Тогда Продолжить КонецЕсли; 					
	//	
	//	Движение=Движения.ЗаказыПоставщикам.Добавить();  
	//	
	//	Движение.Период			=Дата;
	//	Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
	//	
	//	Движение.Склад			= Склад;
	//	Движение.Номенклатура	= СтрокаТЧ.Номенклатура;
	//	Движение.Заказ			= Ссылка;
	//	
	//	Движение.Количество		= СтрокаТЧ.Количество;				
	//	Движение.СуммаРуб		= глПересчет(СтрокаТЧ.Всего,Валюта,Курс,Рубли,	Курс);
	//	Движение.СуммаEUR		= глПересчет(СтрокаТЧ.Всего,Валюта,Курс,Евро,	КурсЕвро);
	//	Движение.СуммаUSD		= глПересчет(СтрокаТЧ.Всего,Валюта,Курс,Доллары,КурсДоллара);
	//	
	//	Движение.Отправитель	= Контрагент;
	//КонецЦикла;
	
     //--Данилова Е.В. 11.08.2025
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
		
	ВидОснования	= Основание.Метаданные().Имя;		
	ДокОснование	= Основание;	
	ИБ				= Основание.ИБ;
		
	Контрагент 		= ПолучитьРеквизитОбъекта(ДокОснование,"Контрагент");	
	Договор			= ПолучитьРеквизитОбъекта(ДокОснование,"Договор");
	
	Менеджер 		= ПолучитьРеквизитОбъекта(ДокОснование,"Менеджер");
	
	Организация		= ПолучитьРеквизитОбъекта(ДокОснование,"Организация");		
	Склад			= ПолучитьРеквизитОбъекта(ДокОснование,"Склад");	
	
	ГруппыТоваров	= ПолучитьРеквизитОбъекта(ДокОснование,"ГруппыТоваров");
	
	ТипЦен			= ПолучитьРеквизитОбъекта(ДокОснование,"ТипЦен");
	ТипСкидок		= ПолучитьРеквизитОбъекта(ДокОснование,"ТипСкидок");
	Скидка1			= ПолучитьРеквизитОбъекта(ДокОснование,"Скидка");	
	
	Комментарий		= ""+ДокОснование.Метаданные()+" № " + ДокОснование.Номер + " от " + Формат(ДокОснование.Дата,"ДФ=dd.MM.yy")+". "+ДокОснование.Комментарий;	
		
	Для Каждого исхСтрокаТЧ Из ДокОснование.Товары Цикл
		СтрокаТЧ = Товары.Добавить();		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,исхСтрокаТЧ);		
		строкатч.Остаток = СтрокаТЧ.Количество;	
			Если СтрокаТЧ.Количество=0 Тогда
			Товары.Удалить(СтрокаТЧ);	
		Иначе
			РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);
		КонецЕсли; 
	КонецЦикла;	
КонецПроцедуры

//крохин начало 08.10.2020
Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ОбновитьДанныеЗаказов();
КонецПроцедуры

Процедура ОбновитьДанныеЗаказов()
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
               |	ЗаявкаНаПроизводствоТовары.ЗаказКонтрагента КАК ЗаказКонтрагента
               |ИЗ
               |	Документ.ЗаявкаНаПроизводство.Товары КАК ЗаявкаНаПроизводствоТовары
               |ГДЕ
               |	ЗаявкаНаПроизводствоТовары.ЗаказКонтрагента <> &ЗаказКонтрагента
               |	И ЗаявкаНаПроизводствоТовары.Ссылка = &Ссылка";
Запрос.УстановитьПараметр("Ссылка",Ссылка);
Запрос.УстановитьПараметр("ЗаказКонтрагента",Документы.Заказ.ПустаяСсылка());
Выборка = Запрос.Выполнить().Выбрать();

Пока Выборка.Следующий() Цикл
ДокЗаказ = Выборка.ЗаказКонтрагента.ПолучитьОбъект();
ДокЗаказ.УстановитьЗаказ(Ссылка);
КонецЦикла;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры

//крохин конец 08.10.2020

#Область Комплектующие 
//++Данилова Е.В. 28.07.2025
Процедура ЗаполнитьТЧКомплектующие()  
		
	//ЗаполнениеДокументов.ЗаполнитьТЧКомплектующие(ЭтотОбъект,,,,истина);
	ЗаполнениеДокументов.ЗаполнитьТЧКомплектующиеСоСверткой(ЭтотОбъект,,,,истина);
	Для каждого СтрокаТЧ Из Товары Цикл
		
		ЗаполнитьКоличествоКомплектующихПоСтроке(СтрокаТЧ); 	
		
	КонецЦикла;
	
	//Сообщить("Была (пере)заполнена Табличная часть ""Комплектующие""");
		
КонецПроцедуры

Процедура ПроверитьТЧКомплектующие(Отказ)

	
	КоличествоКомплектующих = Комплектующие.Итог("Количество");
	
	КоличествоКомплектующихДляСверки = Товары.Итог("КоличествоКомплектующих");
	
	Если КоличествоКомплектующихДляСверки = 0 Тогда
		Для каждого СтрокаТЧ из Товары цикл
			ЗаполнитьКоличествоКомплектующихПоСтроке(СтрокаТЧ);		
		КонецЦикла;			
	КонецЕсли;
	
	Если не ОбменДанными.Загрузка тогда
		Если Товары.Итог("КоличествоКомплектующих") <> Комплектующие.Итог("Количество") тогда
			СообщитьИзМодуля("Не совпадает количество комплектующих в таблице состав и в таблице комплектующие");
			Отказ = Истина; 
		КонецЕсли;
		
		//ТЧНоменклатура = Товары.Выгрузить(,"Номенклатура");
		//ТЧНоменклатура.Свернуть("Номенклатура"); 
		МассивНоменклатуры = ПолучитьМассивНоменклатуры("Товары","Номенклатура");//ТЧНоменклатура.ВыгрузитьКолонку("Номенклатура"); 
		
		//ТЧПродукции = Комплектующие.Выгрузить(,"Продукция"); 
		//ТЧПродукции.Свернуть("Продукция"); 	
		
		МассивПродукции = ПолучитьМассивНоменклатуры("Комплектующие","Продукция");//ТЧПродукции.ВыгрузитьКолонку("Продукция");
		
		Если МассивНоменклатуры.Количество() <>  МассивПродукции.Количество() Тогда
			
			Отказ = истина; 
			Сообщить("Не совпадает номенклатура на закладке Состав и Комплектующие");
		Иначе 
			Для каждого ЭлементТовара Из МассивНоменклатуры Цикл
				
				Если МассивПродукции.Найти(ЭлементТовара) = неопределено Тогда
					
					Отказ = Истина; 	
					
					Сообщить("Не совпадает номенклатура на закладке Состав:" +Строка(ЭлементТовара)  + " и Комплектующие: не найдено");
					
				КонецЕсли;	
				
			КонецЦикла; 
			
			Для каждого ЭлементТовара Из МассивПродукции Цикл
				
				Если МассивНоменклатуры.Найти(ЭлементТовара) = неопределено Тогда
					
					Отказ = Истина; 	
					
					Сообщить("Не совпадает номенклатура на закладке Комплектующие:" +Строка(ЭлементТовара)  + " и Состав: не найдено");
					
				КонецЕсли;	
				
			КонецЦикла;

		КонецЕсли;
		
	КонецЕсли;                                
	

КонецПроцедуры

Процедура ДвижениеПоЗаказамПоставщикам(ИмяТЧДляДвижений,ИмяРНакопления)
	
	Доллары		= Справочники.Валюты.НайтиПоКоду("840");
	Евро		= Справочники.Валюты.НайтиПоКоду("978");
	
	КурсВалюты	= ПолучитьКурсВалюты_ПоРусски(Валюта,Дата);
	
	ВалютаУпр	= ?(Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);
	КурсУпр		= ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,Дата);
	
	КурсДоллара	= ПолучитьКурсВалюты(Доллары,Дата).Курс;
	КурсЕвро	= ПолучитьКурсВалюты(Евро,Дата).Курс;
	Рубли		= ПараметрыСеанса.ВалютаНац;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаПроизводствоКомплектующие.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаявкаНаПроизводствоКомплектующие.Количество) КАК Количество,
	|	ЗаявкаНаПроизводствоКомплектующие.Единица КАК Единица,
	|	ЗаявкаНаПроизводствоКомплектующие.Коэффициент КАК Коэффициент,
	|	МАКСИМУМ(ЗаявкаНаПроизводствоКомплектующие.Цена) КАК Цена,
	|	СУММА(ЗаявкаНаПроизводствоКомплектующие.Сумма) КАК Сумма,
	|	СУММА(ЗаявкаНаПроизводствоКомплектующие.Всего) КАК Всего
	|ИЗ
	|	Документ.ЗаявкаНаПроизводство.%ИмяТЧДляДвижений% КАК ЗаявкаНаПроизводствоКомплектующие
	|ГДЕ
	|	ЗаявкаНаПроизводствоКомплектующие.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаПроизводствоКомплектующие.Единица,
	|	ЗаявкаНаПроизводствоКомплектующие.Номенклатура,
	|	ЗаявкаНаПроизводствоКомплектующие.Коэффициент";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИмяТЧДляДвижений%",ИмяТЧДляДвижений); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтрокаТЧ = РезультатЗапроса.Выбрать(); 
	
	//Для Каждого СтрокаТЧ Из Товары Цикл
	Пока СтрокаТЧ.Следующий() Цикл
		//--Данилова Е.В. 29.07.2025
		Если СтрокаТЧ.Количество=0 Тогда Продолжить КонецЕсли; 					
		
		//Движение=Движения.ЗаказыПоставщикам.Добавить();
		Движение=Движения[ИмяРНакопления].Добавить();
		
		Движение.Период			=Дата;
		Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
		
		Движение.Склад			= Склад;
		Движение.Номенклатура	= СтрокаТЧ.Номенклатура;
		Движение.Заказ			= Ссылка;
		
		Движение.Количество		= СтрокаТЧ.Количество;				
		Движение.СуммаРуб		= глПересчет(СтрокаТЧ.Всего,Валюта,Курс,Рубли,	Курс);
		Движение.СуммаEUR		= глПересчет(СтрокаТЧ.Всего,Валюта,Курс,Евро,	КурсЕвро);
		Движение.СуммаUSD		= глПересчет(СтрокаТЧ.Всего,Валюта,Курс,Доллары,КурсДоллара);
		
		Движение.Отправитель	= Контрагент;
	КонецЦикла;
	

КонецПроцедуры

Функция ПолучитьМассивНоменклатуры(ИмяТЧ,ИмяКолонки)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаявкаНаПроизводствоТовары.%ИмяКолонки% КАК Номенклатура,
		|	ЗаявкаНаПроизводствоТовары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	&Товары КАК ЗаявкаНаПроизводствоТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТТовары.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|ГДЕ
		|	ВТТовары.Количество > 0
		|	И ВЫРАЗИТЬ(ВТТовары.Номенклатура КАК Справочник.Номенклатура).Родитель.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)"; 	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИмяКолонки%",ИмяКолонки);
	
	Запрос.УстановитьПараметр("Товары",ЭтотОбъект[ИмяТЧ].Выгрузить()); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура"); 


КонецФункции 

//--Данилова Е.В. 28.07.2025
#КонецОбласти



НеКонтролироватьЗапись=Ложь;
